{
    "author": "Opentrons\nOpentrons has launched a new Protocol Library. This page won’t be available after March 31st, 2024. Submit a request to add this protocol to the new library.",
    "categories": {
        "Sample Prep": [
            "Microscopy Slide Antibody Staining"
        ]
    },
    "deck-setup": "",
    "description": "This protocol performs immunostaining of slides in a custom 3D printed slide block with Shandon coverplates.\nUp to 7 slide blocks, each with 8 wells can be placed on the deck resulting in the ability to immunostain up to 56 slides simultaneously.\nThe protocol can be stopped after the addition of the block reagent if the user wants to incubate the slides overnight, and can be restarted at the next step which is the addition of the 1st antibody.\nPipette racks and reagents may have to be replaced during the run depending on the number of samples. If that happens the lights on the OT-2 will flash to indicate that the protocol requires the users attention.\nExplanation of parameters below:\n Number of slide blocks: How many slide holding blocks there are on the deck. The maximum number that will fit on the deck are 7.\n Number of samples in the last block: All slide blocks except the last one are assumed to be full, however the last block may have a number of samples between 1 and 8\n Volume in reagents containers: How much volume (µL) there is in each reagent tube (meaning block, antibody 1, antibody 2, and nuclear counterstain tubes). It is a good idea to have some amount of excess in each tube, about 50-100 uL to account for pipetting variance.\n Sweep dispense steps: How many discrete step motions + dispenses to do when dispensing reagents and PBS, this is designed to replicate a sweeping motion with a manual pipette while dispensing. For example if the parameter is set to 5 the pipette will cover the length of the Shandon coverplate's mouth in 5 steps and dispense a 5th of the total dispensation volume each time.\n Reagent tuberack: What type of tuberack you wish to use for the reagents (block, the antibodies and the nuclear counterstain). The maximal number of tubes for any reagents is 4 (a full column, so dimension the tubes accordingly). The maximal required volume for each reagent is 4.9 mL for a full deck (7 blocks8 samples each). This volume would fit for example in 4 1.5 mL tubes.\n Pipette offset: Pipetting offset in millimeter when dispensing, increasing this parameter will mean that the pipette will dispense at a higher height in the wells, while making it negative will lower the height of dispenses. This parameter must be adjusted carefully so that there are no collisions between the pipette tip and the Shandon coverplates!\n Start protocol after 1st incubation step: Starts the protocol at the step after the samples have already been incubated with block overnight.\n Stop protocol after 1st incubation step: The protocol stops after adding the block reagent and the user is asked to incubate the samples at 4 degrees C overnight.\n Do a dry run?: Skip all incubation pauses and return tips to their racks after use.\n Time per block (s): The amount of time it takes to transfer reagent per block. The user must measure the time it takes for the reagent dispensation steps to finish for each block using a stopwatch, for example by putting the maximum of of seven blocks on the deck, running the protocol and then calculating the average block time by dividing by seven. This time is used to subtract from the total incubation time such that each sample will have an hour of incubation instead of 1 hour plus the time it takes to transfer reagent or PBS.\n Multi-dispense reagents?: Whether to aspirate a 100 uL of reagent at a time and dispense it in the next well or aspirate 900 uL and go from well to well dispensing 100 uL each before picking up more reagent.\n Reuse reagent tips?: Use the same tip for each individual reagent.\n Reuse PBS wash tips?: Use one tip to do one wash with PBS\n Use temperature module?: Whether to use a temperature module to chill the reagents in the tuberack, or put the tuberack directly on the slot.\n P1000 slot: Which mount to use for the P1000 single GEN2 pipette\n Reagent tuberack: Which reagent tuberack you want to use in the protocol\n Well edge offset (mm): The offset from the well's edge when performing the dispensing while moving action. The pipette will start dispensing on one side of the well minus the offset and will travel to the other side of the well minus the same offset.\n Use a custom slide block: Setting this parameter to Yes means that the protocol will try to load an alternative definition for the slide block. See Custom labware loadName parameter below.\n Custom labware loadName: Put the labware load name of the alternative slide block labware definition you wish to use. To find the loadName: Open your labware_definition.json file, look for the section \"parameters\"\ne.g.\n\"parameters\": {\n        \"format\": \"irregular\",\n        \"quirks\": [],\n        \"isTiprack\": false,\n        \"isMagneticModuleCompatible\": false,\n        \"loadName\": \"customslideblockv2_8_wellplate\"\nand copy the value of loadName (without the quotation marks). paste that value into this parameter field, i.e. in this case that would be: customslideblockv2_8_wellplate\nRemember to load the labware into the Opentrons app before running your protocol\n",
    "internal": "357404",
    "labware": "\nOpentrons tuberacks\nOpentrons tubes & vials\nAgilent 1-Well Reservoir 290 mL\n1000 uL tipracks\nOpentrons aluminum block set (optional)\nAgilent 1-Well Reservoir 290 mL\nCustom 3D printed block for holding Shandon coverplates + slides.\n",
    "markdown": {
        "author": "[Opentrons](https://opentrons.com/)\n\n\n# Opentrons has launched a new Protocol Library. This page won’t be available after March 31st, 2024. [Submit a request](https://docs.google.com/forms/d/e/1FAIpQLSdYYp9QCKow4nn0KlCVsMS3HX0eJ0N9O7-erajKvcpT0lWbSg/viewform) to add this protocol to the new library.\n\n",
        "categories": "* Sample Prep\n\t* Microscopy Slide Antibody Staining\n\n",
        "deck-setup": "![deck layout](https://opentrons-protocol-library-website.s3.amazonaws.com/custom-README-images/357404/deck.jpg)\n\n",
        "description": "This protocol performs immunostaining of slides in a custom 3D printed slide block with Shandon coverplates.\nUp to 7 slide blocks, each with 8 wells can be placed on the deck resulting in the ability to immunostain up to 56 slides simultaneously.\n\nThe protocol can be stopped after the addition of the block reagent if the user wants to incubate the slides overnight, and can be restarted at the next step which is the addition of the 1st antibody.\n\nPipette racks and reagents may have to be replaced during the run depending on the number of samples. If that happens the lights on the OT-2 will flash to indicate that the protocol requires the users attention.\n\nExplanation of parameters below:\n* `Number of slide blocks`: How many slide holding blocks there are on the deck. The maximum number that will fit on the deck are 7.\n* `Number of samples in the last block`: All slide blocks except the last one are assumed to be full, however the last block may have a number of samples between 1 and 8\n* `Volume in reagents containers`: How much volume (µL) there is in each reagent tube (meaning block, antibody 1, antibody 2, and nuclear counterstain tubes). It is a good idea to have some amount of excess in each tube, about 50-100 uL to account for pipetting variance.\n* `Sweep dispense steps`: How many discrete step motions + dispenses to do when dispensing reagents and PBS, this is designed to replicate a sweeping motion with a manual pipette while dispensing. For example if the parameter is set to 5 the pipette will cover the length of the Shandon coverplate's mouth in 5 steps and dispense a 5th of the total dispensation volume each time.\n* `Reagent tuberack`: What type of tuberack you wish to use for the reagents (block, the antibodies and the nuclear counterstain). The maximal number of tubes for any reagents is 4 (a full column, so dimension the tubes accordingly). The maximal required volume for each reagent is 4.9 mL for a full deck (7 blocks*8 samples each). This volume would fit for example in 4 1.5 mL tubes.\n* `Pipette offset`: Pipetting offset in `millimeter` when dispensing, increasing this parameter will mean that the pipette will dispense at a higher height in the wells, while making it negative will lower the height of dispenses. **This parameter must be adjusted carefully so that there are no collisions between the pipette tip and the Shandon coverplates!**\n* `Start protocol after 1st incubation step`: Starts the protocol at the step after the samples have already been incubated with `block` overnight.\n* `Stop protocol after 1st incubation step`: The protocol stops after adding the block reagent and the user is asked to incubate the samples at 4 degrees C overnight.\n* `Do a dry run?`: Skip all incubation pauses and return tips to their racks after use.\n* `Time per block (s)`: The amount of time it takes to transfer reagent per block. The user must measure the time it takes for the reagent dispensation steps to finish for each block using a stopwatch, for example by putting the maximum of of seven blocks on the deck, running the protocol and then calculating the average block time by dividing by seven. This time is used to subtract from the total incubation time such that each sample will have an hour of incubation instead of 1 hour plus the time it takes to transfer reagent or PBS.\n* `Multi-dispense reagents?`: Whether to aspirate a 100 uL of reagent at a time and dispense it in the next well or aspirate 900 uL and go from well to well dispensing 100 uL each before picking up more reagent.\n* `Reuse reagent tips?`: Use the same tip for each individual reagent.\n* `Reuse PBS wash tips?`: Use one tip to do one wash with PBS\n* `Use temperature module?`: Whether to use a temperature module to chill the reagents in the tuberack, or put the tuberack directly on the slot.\n* `P1000 slot`: Which mount to use for the P1000 single GEN2 pipette\n* `Reagent tuberack`: Which reagent tuberack you want to use in the protocol\n* `Well edge offset (mm)`: The offset from the well's edge when performing the dispensing while moving action. The pipette will start dispensing on one side of the well minus the offset and will travel to the other side of the well minus the same offset.\n* `Use a custom slide block`: Setting this parameter to Yes means that the protocol will try to load an alternative definition for the slide block. See `Custom labware loadName` parameter below.\n* `Custom labware loadName`: Put the labware load name of the alternative slide block labware definition you wish to use. To find the loadName: Open your labware_definition.json file, look for the section \"parameters\"\ne.g.\n```\n\"parameters\": {\n\t\t\"format\": \"irregular\",\n\t\t\"quirks\": [],\n\t\t\"isTiprack\": false,\n\t\t\"isMagneticModuleCompatible\": false,\n\t\t\"loadName\": \"customslideblockv2_8_wellplate\"\n```\nand copy the value of loadName (without the quotation marks). paste that value into this parameter field, i.e. in this case that would be: `customslideblockv2_8_wellplate`\n\nRemember to load the labware into the Opentrons app before running your protocol\n\n---\n\n",
        "internal": "357404\n",
        "labware": "* [Opentrons tuberacks](https://shop.opentrons.com/4-in-1-tube-rack-set/)\n* [Opentrons tubes & vials](https://shop.opentrons.com/consumables/)\n* [Agilent 1-Well Reservoir 290 mL](https://labware.opentrons.com/agilent_1_reservoir_290ml)\n* [1000 uL tipracks](https://shop.opentrons.com/opentrons-1000-l-tips/)\n* [Opentrons aluminum block set](https://shop.opentrons.com/aluminum-block-set/) (optional)\n* [Agilent 1-Well Reservoir 290 mL](https://labware.opentrons.com/agilent_1_reservoir_290ml)\n* Custom 3D printed block for holding Shandon coverplates + slides.\n\n",
        "modules": "* [Temperature Module (GEN2)](https://shop.opentrons.com/collections/hardware-modules/products/tempdeck) (optional)\n\n",
        "notes": "If you have any questions about this protocol, please contact the Protocol Development Team by filling out the [Troubleshooting Survey](https://protocol-troubleshooting.paperform.co/).\n\n",
        "pipettes": "* [P1000 single-Channel (GEN2)](https://shop.opentrons.com/single-channel-electronic-pipette-p20/)\n\n",
        "process": "1. Input your protocol parameters above.\n2. Download your protocol and unzip if needed.\n3. Upload your custom labware to the [OT App](https://opentrons.com/ot-app) by navigating to `More` > `Custom Labware` > `Add Labware`, and selecting your labware files (.json extensions) if needed.\n4. Upload your protocol file (.py extension) to the [OT App](https://opentrons.com/ot-app) in the `Protocol` tab.\n5. Set up your deck according to the deck map.\n6. Calibrate your labware, tiprack and pipette using the OT App. For calibration tips, check out our [support articles](https://support.opentrons.com/en/collections/1559720-guide-for-getting-started-with-the-ot-2).\n7. Hit 'Run'.\n\n",
        "protocol-steps": "1. The temperature module is set to 4 degrees C.\n2. 100 µL of Block is added to the samples wells, unless the protocol is set to skip the 1st reagent addition step.\n3. The protocol incubates for 1 hour (with the time it takes to add the Block reagent subtracted)\n4. 100 µL Antibody 1 is added (This may be the 1st reagent added in the protocol if the user chooses to start with samples that have been incubated overnight with Block)\n5. The protocol incubates for 1 hour\n6. The slides are washed with 4 mL PBS each\n7. 100 µL of Antibody 2 is added to each slide\n8. The protocol incubates for 1 hour\n9.  The slides are washed with 4 mL PBS each\n10. 100 µL of nuclear counterstain is added to each slide\n11. The protocol pauses for 5 minutes\n12. The slides are washed with 4 mL PBS each\n\n",
        "reagent-setup": "* Reservoir 2: slot 3\n![Reagent reservoir](https://opentrons-protocol-library-website.s3.amazonaws.com/custom-README-images/357404/reagent_tuberack.jpg)\n\n---\n\n",
        "reagents": "290 mL reservoir on slot 2:\n* Phosphate buffered saline (PBS)\n\nReagent tuberack on slot 3:\n* Block\n* Antibody 1\n* Antibody 2\n* Nuclear counterstain\n\n---\n\n",
        "title": "Slide Sample Antibody Staining"
    },
    "modules": [
        "Temperature Module (GEN2) (optional)"
    ],
    "notes": "If you have any questions about this protocol, please contact the Protocol Development Team by filling out the Troubleshooting Survey.",
    "pipettes": "\nP1000 single-Channel (GEN2)\n",
    "process": "\nInput your protocol parameters above.\nDownload your protocol and unzip if needed.\nUpload your custom labware to the OT App by navigating to More > Custom Labware > Add Labware, and selecting your labware files (.json extensions) if needed.\nUpload your protocol file (.py extension) to the OT App in the Protocol tab.\nSet up your deck according to the deck map.\nCalibrate your labware, tiprack and pipette using the OT App. For calibration tips, check out our support articles.\nHit 'Run'.\n",
    "protocol-steps": "\nThe temperature module is set to 4 degrees C.\n100 µL of Block is added to the samples wells, unless the protocol is set to skip the 1st reagent addition step.\nThe protocol incubates for 1 hour (with the time it takes to add the Block reagent subtracted)\n100 µL Antibody 1 is added (This may be the 1st reagent added in the protocol if the user chooses to start with samples that have been incubated overnight with Block)\nThe protocol incubates for 1 hour\nThe slides are washed with 4 mL PBS each\n100 µL of Antibody 2 is added to each slide\nThe protocol incubates for 1 hour\nThe slides are washed with 4 mL PBS each\n100 µL of nuclear counterstain is added to each slide\nThe protocol pauses for 5 minutes\nThe slides are washed with 4 mL PBS each\n",
    "reagent-setup": "\nReservoir 2: slot 3\n\n\n",
    "reagents": [],
    "title": "Slide Sample Antibody Staining"
}