{
    "author": "Opentrons",
    "categories": {
        "Protein Purification": [
            "Generic Protein Purification"
        ]
    },
    "deck-setup": "",
    "description": "The generic protein purification is a flexible protocol that starts from bacterial\nmedia ready for lysis on a well plate. From there the protocol adds lysis buffer\nand then proceeds to bind the target his-tagged proteins with nickel linked paramagnetic beads. After a variable amount of washes the user may choose to\nelute the proteins using elution buffer, or with SDS buffer if the purpose is to\nrun the samples on a gel.\nThe user is given extensive control of the protocol from the parameters. Pipettes, labware, modules (i.e. temperature and magnetic modules), protocol steps, and volumes are examples of things that can be customized to the users specifications.\nThe protocol is based on Promega's MagneHis™ system, but should work for any other similar system.\nParameters\n\nMagnet engagment time for bead binding How long to engage magnets in order to attract the beads before doing any pipetting steps\nNumber of samples How many bacterial media samples there are on the sample plate\nSmall pipette The smaller pipette, can be a multi-channel or single\nLarge pipetteThe larger pipette, can be a multi-channel or single\nSmall pipette tip-racks Tips to use with the small pipette\nLarge pipette tip-racks Tips to use with the large pipette\nReagent reservoir 12 well reservoir for reagents: Lysis buffer, NaCl (optional), Wash buffer, elution buffer, SDS buffer (optional), paramegnetic beads.\nDestination plate Plate where eluted proteins are transferred after adding elution or SDS buffer\nSample plate Plate containing wells with bacterial media\nMagnetic module Which magnetic module to use for the bead binding steps\nTube rack (optional) Tube rack for DNAse I (well 1) if used.\nDestination plate temperature module (optional) A temperature module for controlling the temperature of the destination plate\nPause robot operation to allow user to vortex magnetic beads? If this parameter is on, the robot will pause before the paramagnetic bead addition step to allow the user to resuspend the beads by vortexing the solution before adding it to the reservoir.\nElute proteins in SDS buffer instead of elution buffer Allows the user to elute proteins with SDS buffer instead of elution buffer if the proteins are intended to be run on a gel\nAdd DNAse I to lysis sample from a tube? If yes, then DNAse will be added from well A1 of the (optional) tube rack. If no, then the DNAse should be added to the lysis buffer in the reservoir prior to running the protocol\nAdd NaCl to samples to a conc. of 500 mM during wash steps to enhance protein binding? Optional; If you want to do this step, Add a 4M NaCl solution to the reservoir (see picture in the deck setup section)\nVolume of paramagnetic beads to use with each sample (µL) Volume of paramagnetic beads to add to each sample well after the lysis step\nInitial volume (of bacteria containing media in each sample well) (µL) Initial volume of sample in each sample plate well containing bacterial culture to be lysed.\nWash buffer volume for the washing steps (µL) Volume of wash buffer to use in each washing step\nElution buffer volume to elute proteins with (µL) How much elution buffer to elute the purified protein with.\nNumber of washing steps How many repetitions of washing the beads to remove unwanted proteins and other contaminants.\nNumber of times to mix the wash buffer with the beads for each wash step Number of times to mix (pipette solution up and down) for each washing step in order to mix the solution.\nNumber of times to mix the elution buffer with the beads Number of times to mix the elution buffer with the samples before transferring the protein containing supernatant.\nBead incubation time for binding and eluting protein (before magnets are engaged) How many minutes to incubate beads with the lysed bacterial solution before engaging magnets, also the amount of time to incubate the beads with elution buffer before engaging magnets.\nNumber of times to mix the bead solution before transferring beads to the samples Optional number of times to use the large pipette to mix the bead solution before transferring the bead solution to the samples\nSDS buffer volume to elute proteins with (optional: this only matters if you decide to elute with SDS buffer) In the final step you can choose whether to elute with elution buffer or SDS buffer if you want to run a gel on the samples, this parameter specifies the volume in microliter of SDS buffer.\n\n",
    "internal": "generic_protein_purification",
    "labware": "\n12-well Reservoirs\nNEST 12 well reservoir, 15 mL\n\n\nWell plates\nNEST 2 mL 96-Well Deep Well Plate\n\n\nTarget plate\nNEST 96 Well Plate Flat\n\n\nTube racks\n4-in-1 Tube Rack Set\n\n\n",
    "markdown": {
        "author": "[Opentrons](https://opentrons.com/)\n\n\n\n",
        "categories": "* Protein Purification\n    * Generic Protein Purification\n\n",
        "deck-setup": "![deck layout](https://opentrons-protocol-library-website.s3.amazonaws.com/custom-README-images/generic_protein_purification/deck.jpg)\n\n",
        "description": "\nThe generic protein purification is a flexible protocol that starts from bacterial\nmedia ready for lysis on a well plate. From there the protocol adds lysis buffer\nand then proceeds to bind the target his-tagged proteins with nickel linked paramagnetic beads. After a variable amount of washes the user may choose to\nelute the proteins using elution buffer, or with SDS buffer if the purpose is to\nrun the samples on a gel.\n\nThe user is given extensive control of the protocol from the parameters. Pipettes, labware, modules (i.e. temperature and magnetic modules), protocol steps, and volumes are examples of things that can be customized to the users specifications.\n\nThe protocol is based on Promega's MagneHis™ system, but should work for any other similar system.\n\n**Parameters**\n\n* `Magnet engagment time for bead binding` How long to engage magnets in order to attract the beads before doing any pipetting steps\n* `Number of samples` How many bacterial media samples there are on the sample plate\n* `Small pipette` The smaller pipette, can be a multi-channel or single\n* `Large pipette`The larger pipette, can be a multi-channel or single\n* `Small pipette tip-racks` Tips to use with the small pipette\n* `Large pipette tip-racks` Tips to use with the large pipette\n* `Reagent reservoir` 12 well reservoir for reagents: Lysis buffer, NaCl (optional), Wash buffer, elution buffer, SDS buffer (optional), paramegnetic beads.\n* `Destination plate` Plate where eluted proteins are transferred after adding elution or SDS buffer\n* `Sample plate` Plate containing wells with bacterial media\n* `Magnetic module` Which magnetic module to use for the bead binding steps\n* `Tube rack (optional)` Tube rack for DNAse I (well 1) if used.\n* `Destination plate temperature module (optional)` A temperature module for controlling the temperature of the destination plate\n* `Pause robot operation to allow user to vortex magnetic beads?` If this parameter is on, the robot will pause before the paramagnetic bead addition step to allow the user to resuspend the beads by vortexing the solution before adding it to the reservoir.\n* `Elute proteins in SDS buffer instead of elution buffer` Allows the user to elute proteins with SDS buffer instead of elution buffer if the proteins are intended to be run on a gel\n* `Add DNAse I to lysis sample from a tube?` If yes, then DNAse will be added from well A1 of the (optional) tube rack. If no, then the DNAse should be added to the lysis buffer in the reservoir prior to running the protocol\n* `Add NaCl to samples to a conc. of 500 mM during wash steps to enhance protein binding?` Optional; If you want to do this step, Add a 4M NaCl solution to the reservoir (see picture in the deck setup section)\n* `Volume of paramagnetic beads to use with each sample (µL)` Volume of paramagnetic beads to add to each sample well after the lysis step\n* `Initial volume (of bacteria containing media in each sample well) (µL)` Initial volume of sample in each sample plate well containing bacterial culture to be lysed.\n* `Wash buffer volume for the washing steps (µL)` Volume of wash buffer to use in each washing step\n* `Elution buffer volume to elute proteins with (µL)` How much elution buffer to elute the purified protein with.\n* `Number of washing steps` How many repetitions of washing the beads to remove unwanted proteins and other contaminants.\n* `Number of times to mix the wash buffer with the beads for each wash step` Number of times to mix (pipette solution up and down) for each washing step in order to mix the solution.\n* `Number of times to mix the elution buffer with the beads` Number of times to mix the elution buffer with the samples before transferring the protein containing supernatant.\n* `Bead incubation time for binding and eluting protein (before magnets are engaged)` How many minutes to incubate beads with the lysed bacterial solution before engaging magnets, also the amount of time to incubate the beads with elution buffer before engaging magnets.\n* `Number of times to mix the bead solution before transferring beads to the samples` Optional number of times to use the large pipette to mix the bead solution before transferring the bead solution to the samples\n* `SDS buffer volume to elute proteins with (optional: this only matters if you decide to elute with SDS buffer)` In the final step you can choose whether to elute with elution buffer or SDS buffer if you want to run a gel on the samples, this parameter specifies the volume in microliter of SDS buffer.\n\n---\n\n",
        "internal": "generic_protein_purification\n",
        "labware": "* [12-well Reservoirs](https://labware.opentrons.com/?category=reservoir)\n\t* [NEST 12 well reservoir, 15 mL](https://shop.opentrons.com/nest-12-well-reservoirs-15-ml/)\n* [Well plates](https://labware.opentrons.com/?category=wellPlate)\n\t* [NEST 2 mL 96-Well Deep Well Plate](https://shop.opentrons.com/nest-2-ml-96-well-deep-well-plate-v-bottom/)\n* [Target plate](https://labware.opentrons.com/?category=wellPlate)\n\t* [NEST 96 Well Plate Flat](https://shop.opentrons.com/nest-96-well-plate-flat/)\n* [Tube racks](https://labware.opentrons.com/?category=tubeRack)\n\t* [4-in-1 Tube Rack Set](https://shop.opentrons.com/4-in-1-tube-rack-set/)\n\n",
        "modules": "* [Temperature Module (GEN2)](https://shop.opentrons.com/collections/hardware-modules/products/tempdeck)\n* [Magnetic Module (GEN2)](https://shop.opentrons.com/collections/hardware-modules/products/magdeck)\n\n",
        "notes": "If you have any questions about this protocol, please contact the Protocol Development Team by filling out the [Troubleshooting Survey](https://protocol-troubleshooting.paperform.co/).\n\n",
        "pipettes": "* [Opentrons Pipettes](https://opentrons.com/pipettes/)\n\n",
        "process": "1. Input your protocol parameters above.\n2. Download your protocol and unzip if needed.\n3. Upload your custom labware to the [OT App](https://opentrons.com/ot-app) by navigating to `More` > `Custom Labware` > `Add Labware`, and selecting your labware files (.json extensions) if needed.\n4. Upload your protocol file (.py extension) to the [OT App](https://opentrons.com/ot-app) in the `Protocol` tab.\n5. Set up your deck according to the deck map.\n6. Calibrate your labware, tiprack and pipette using the OT App. For calibration tips, check out our [support articles](https://support.opentrons.com/en/collections/1559720-guide-for-getting-started-with-the-ot-2).\n7. Hit 'Run'.\n\n",
        "protocol-steps": "The protocol is based on [MagneHis protein purification protocol](https://www.promega.com/-/media/files/resources/protocols/technical-manuals/0/magnehis-protein-purification-system-protocol.pdf?rev=cbf49f7cf6fa4696b965c92c1f8e9c72&sc_lang=en), however a similar kit should work as well.\n1. Bacterial lysis: Lysis buffer is added to all the sample wells. If the DNAse step is activated DNAse will be added to each well as well (see parameter options below). If it's not activated DNAse I should be added to the lysis buffer by the user before running the protocol (1 µL per mL of bacterial media to lyse)\n2. The protocol is paused to allow the user to shake the sample plate for 10-20 minutes at room temperature for the lysis reaction to complete\n3. Binding: The paramagnetic beads are added to the samples, along with sodium chloride, if desired. The user has an option to pause the protocol before this step in order to vortex the beads in order to resuspend them. The user may also specify a number of mixes with the pipettes to help homogenize the solution.\n4. The beads are washed with wash buffer (and optionally NaCl) and the supernatant is removed while the magnets on the magnetic module are engaged. This is repeated as many times as the user wants.\n5. Elution: Finally the wash supernatant is removed while the magnets are engaged and elution buffer (or optionally: SDS buffer replaces the EB if the user desires to run the samples on a gel) is added. The bead supernatant is transferred to the target plate.\n\n",
        "reagent-setup": "![Reagent reservoir](https://opentrons-protocol-library-website.s3.amazonaws.com/custom-README-images/generic_protein_purification/liquids.jpg)\n\n---\n\n",
        "reagents": "Protein purification kit with paramagnetic beads, for example: [MagneHis™ Protein Purification System](https://www.promega.com/products/protein-purification/protein-purification-kits/magnehis-protein-purification-system/?catNum=V8500#protocols)\n\n---\n\n",
        "title": "Generic Protein Purification Protocol"
    },
    "modules": [
        "Temperature Module (GEN2)",
        "Magnetic Module (GEN2)"
    ],
    "notes": "If you have any questions about this protocol, please contact the Protocol Development Team by filling out the Troubleshooting Survey.",
    "pipettes": "\nOpentrons Pipettes\n",
    "process": "\nInput your protocol parameters above.\nDownload your protocol and unzip if needed.\nUpload your custom labware to the OT App by navigating to More > Custom Labware > Add Labware, and selecting your labware files (.json extensions) if needed.\nUpload your protocol file (.py extension) to the OT App in the Protocol tab.\nSet up your deck according to the deck map.\nCalibrate your labware, tiprack and pipette using the OT App. For calibration tips, check out our support articles.\nHit 'Run'.\n",
    "protocol-steps": "The protocol is based on MagneHis protein purification protocol, however a similar kit should work as well.\n1. Bacterial lysis: Lysis buffer is added to all the sample wells. If the DNAse step is activated DNAse will be added to each well as well (see parameter options below). If it's not activated DNAse I should be added to the lysis buffer by the user before running the protocol (1 µL per mL of bacterial media to lyse)\n2. The protocol is paused to allow the user to shake the sample plate for 10-20 minutes at room temperature for the lysis reaction to complete\n3. Binding: The paramagnetic beads are added to the samples, along with sodium chloride, if desired. The user has an option to pause the protocol before this step in order to vortex the beads in order to resuspend them. The user may also specify a number of mixes with the pipettes to help homogenize the solution.\n4. The beads are washed with wash buffer (and optionally NaCl) and the supernatant is removed while the magnets on the magnetic module are engaged. This is repeated as many times as the user wants.\n5. Elution: Finally the wash supernatant is removed while the magnets are engaged and elution buffer (or optionally: SDS buffer replaces the EB if the user desires to run the samples on a gel) is added. The bead supernatant is transferred to the target plate.",
    "reagent-setup": "\n",
    "reagents": [],
    "title": "Generic Protein Purification Protocol"
}