{"title": "NGS Cleanup and Size Selection with Omega Bio-tek Mag-Bind® TotalPure NGS", "author": "Opentrons", "partner": "Omega Bio-tek", "categories": {"Molecular Biology": ["Nucleic Acid Purification"]}, "description": "\nWith this protocol, you can perform high-quality nucleic acid purifications using Omega Bio-tek Mag-Bind® TotalPure NGS magnetic beads and the Opentrons Magnetic Module. This setup yields high quality PCR product and other nucleic acids without the use of centrifugation or vacuum separation.\nThis kit is widely used in NGS cleanup for its affordability and simplicity. It is also well-adapted for nucleic acid size selection by varying bead ratios for  the  isolation  of  a  wide  array  of  fragment  sizes. For more detailed information on how to use this protocol, please see our Application Note.\n\n\n\nTo purchase tips, reagents, or our Magnetic Module, please visit our online store or contact our Sales team at info@opentrons.com.\n\nOmega Bio-tek Mag-Bind® TotalPure NGS Kit\nOpentrons OT-2\nOpentrons Magnetic Module\nOpentrons OT-2 Run App (Version 3.1.2 or later)\n200uL or 300 uL Tiprack (Opentrons tips suggested)\n12-row automation-friendly trough\nBioRad HardShell 96-Well PCR Plates\nEthanol\nElution Buffer (Typically  10 mM Tris pH 8.0, TE Buffer, or nuclease-free water)\n\n\n\n\nUsing the customization fields below, set up your protocol as follows:\n\nPipette: Specify your pipette. We recommend using a p50 or p300 multi- or single-channel.\nPipette Mount: Specify which mount (left or right) your pipette is on.\nSample number: Customize the number of samples to run per protocol. A multiple of 8 is recommended when you are using a multichannel pipette.\nSample volume: Specify the starting volume (in uL) of the input sample.\nBead Ratio: Customize the ratio of beads for left or right side size-selection of fragments. The default bead ratio is 1.8x the input sample volume.\nElution Volume: Specify the final volume (in uL) to elute the purified nucleic acid. The Opentrons MagDeck supports elution volumes above 10 µL.\n\nMake sure to add reagents to your labware before placing it on the deck! You can see where to place your reagents below.\n\n\n", "time-estimate": "\nVaries.\n", "process": "\nSelect all desired settings according to the \"Setup\" section above to create your customized protocol.\nDownload your customized OT-2 protocol using the blue \"Download\" button.\nUpload your protocol file into the Opentrons Run App and follow the instructions there to set up your deck and proceed to run!\nMake sure to add reagents to your labware before placing it on the deck! You can see where to place your reagents in the \"Setup\" section above.\n", "internal": "Omega Nucleic Acid Purification, v1", "notes": "Please reference our Application Note for more information about the expected output of this protocol, in addition to expanded sample data from the Opentrons and Omega Bio-tek labs.\nIf you'd like to request a more complex purification workflow, please use our Protocol Development Request Form. You can also download the Python file from this page and modify it using our API Documentation. For additional questions about this protocol, please email protocols@opentrons.com.\nIf you are interested in purchasing the Opentrons Magnetic Module or trying out the Omega Bio-tek Mag-Bind® beads, please contact our Sales Team at info@opentrons.com to learn more!", "preview": "With this protocol, you can perform high-quality nucleic acid purifications using the Opentrons Magnetic Module and Omega Bio-tek Mag-Bind® TotalPure NGS magnetic beads. This kit is widely used in NGS cleanup for its affordability and simplicity. You can select specific sizes of nucleic acids by varying the bead-to-DNA ratio across a wide array of fragment sizes. For reagent and module purchasing details contact info@opentrons.com.", "markdown": {"title": "NGS Cleanup and Size Selection with Omega Bio-tek Mag-Bind® TotalPure NGS", "author": "[Opentrons](http://opentrons.com/)\n\n", "partner": "[Omega Bio-tek](http://omegabiotek.com/store/)\n\n", "categories": "* Molecular Biology\n    * Nucleic Acid Purification\n        * Omega Bio-tek Mag-Bind® TotalPure NGS\n\n", "description": "![Omega Bio-tek](https://s3.amazonaws.com/opentrons-protocol-library-website/custom-README-images/001-General+Headings/Omega+Logo.png)\n\nWith this protocol, you can perform high-quality nucleic acid purifications using [Omega Bio-tek Mag-Bind® TotalPure NGS](https://shop.opentrons.com/products/mag-bind-total-pure-ngs) magnetic beads and the [Opentrons Magnetic Module](https://shop.opentrons.com/products/magdeck). This setup yields high quality PCR product and other nucleic acids without the use of centrifugation or vacuum separation.\n\nThis kit is widely used in NGS cleanup for its affordability and simplicity. It is also well-adapted for nucleic acid size selection by varying bead ratios for  the  isolation  of  a  wide  array  of  fragment  sizes. For more detailed information on how to use this protocol, please see our [Application Note](https://s3.amazonaws.com/opentrons-protocol-library-website/Technical+Notes/Omega_Application_Note.pdf).\n\n---\n\n---\n\n![Materials Needed](https://s3.amazonaws.com/opentrons-protocol-library-website/custom-README-images/001-General+Headings/materials.png)\n\nTo purchase tips, reagents, or our Magnetic Module, please [visit our online store](https://shop.opentrons.com/) or contact our Sales team at <info@opentrons.com>.\n\n   * [Omega Bio-tek Mag-Bind® TotalPure NGS Kit](https://shop.opentrons.com/products/mag-bind-total-pure-ngs)\n   * [Opentrons OT-2](http://opentrons.com/ot-2)\n   * [Opentrons Magnetic Module](https://shop.opentrons.com/products/magdeck)\n   * [Opentrons OT-2 Run App (Version 3.1.2 or later)](http://opentrons.com/ot-app)\n   * 200uL or 300 uL Tiprack ([Opentrons tips suggested](https://shop.opentrons.com/collections/opentrons-tips/products/opentrons-300ul-tips-racks-9-600-tips))\n   * [12-row automation-friendly trough](https://www.usascientific.com/12-channel-automation-reservoir.aspx)\n   * [BioRad HardShell 96-Well PCR Plates](http://www.bio-rad.com/en-us/sku/hsp9601-hard-shell-96-well-pcr-plates-low-profile-thin-wall-skirted-white-clear?ID=hsp9601)\n   * Ethanol\n   * Elution Buffer (Typically  10 mM Tris pH 8.0, TE Buffer, or nuclease-free water)\n\n---\n\n---\n\n\n![Setup](https://s3.amazonaws.com/opentrons-protocol-library-website/custom-README-images/001-General+Headings/Setup.png)\n\nUsing the customization fields below, set up your protocol as follows:\n\n   * **Pipette:** Specify your pipette. We recommend using a p50 or p300 multi- or single-channel.\n   * **Pipette Mount:** Specify which mount (left or right) your pipette is on.\n   * **Sample number:** Customize the number of samples to run per protocol. A multiple of 8 is recommended when you are using a multichannel pipette.\n   * **Sample volume:** Specify the starting volume (in uL) of the input sample.\n   * **Bead Ratio:** Customize the ratio of beads for left or right side size-selection of fragments. *The default bead ratio is 1.8x the input sample volume.*\n   * **Elution Volume:** Specify the final volume (in uL) to elute the purified nucleic acid. *The Opentrons MagDeck supports elution volumes above 10 µL.*\n\nMake sure to add reagents to your labware before placing it on the deck! You can see where to place your reagents below.\n\n![Labware setup](https://s3.amazonaws.com/opentrons-protocol-library-website/custom-README-images/Nucleic+Acid+Purification/Nucleic+Acid+Purification+with+Magnetic+Beads+-+Reagent+Start+Position.png)\n\n---\n\n---\n\n", "time-estimate": "* Varies.\n\n", "process": "1. Select all desired settings according to the \"Setup\" section above to create your customized protocol.\n2. Download your customized OT-2 protocol using the blue \"Download\" button.\n3. Upload your protocol file into the Opentrons Run App and follow the instructions there to set up your deck and proceed to run!\n4. Make sure to add reagents to your labware before placing it on the deck! You can see where to place your reagents in the \"Setup\" section above.\n\n", "internal": "Omega Nucleic Acid Purification, v1\n\n", "notes": "Please reference our [Application Note](https://s3.amazonaws.com/opentrons-protocol-library-website/Technical+Notes/Omega_Application_Note.pdf) for more information about the expected output of this protocol, in addition to expanded sample data from the Opentrons and Omega Bio-tek labs.\n\nIf you'd like to request a more complex purification workflow, please use our [Protocol Development Request Form](https://opentrons-protocol-dev.paperform.co/). You can also download the Python file from this page and modify it using our [API Documentation](https://docs.opentrons.com/). For additional questions about this protocol, please email <protocols@opentrons.com>.\n\nIf you are interested in purchasing the Opentrons Magnetic Module or trying out the Omega Bio-tek Mag-Bind® beads, please contact our Sales Team at <info@opentrons.com> to learn more!\n\n", "preview": "With this protocol, you can perform high-quality nucleic acid purifications using the [Opentrons Magnetic Module](https://shop.opentrons.com/products/magdeck) and [Omega Bio-tek Mag-Bind® TotalPure NGS](https://shop.opentrons.com/products/mag-bind-total-pure-ngs) magnetic beads. This kit is widely used in NGS cleanup for its affordability and simplicity. You can select specific sizes of nucleic acids by varying the bead-to-DNA ratio across a wide array of fragment sizes. For reagent and module purchasing details contact <info@opentrons.com>.\n"}}