{
    "author": "Opentrons",
    "categories": {
        "Sample Prep": [
            "PCR prep"
        ]
    },
    "deck-setup": "\n",
    "description": "This protocol transfers saliva samples from 25 mL tubes to a 96 well plate. The samples are located in 6 4-in-4 tube racks on the left side of the deck. Optionally a second set of tube racks can replace the first one if more than 45 samples need to be distributed. Optionally the target plate can be placed on a temperature module with an aluminum block.\nThe destination plate is divided into four quadrants and the samples are distributed in a zig zag pattern from top left - top right - bottom left - bottom right (see below). Samples are not transferred to the three first wells of the target plate because they contain control samples, symmetrically the first 3 tube slots in Sample set 1:Tuberack quadrant 1 contain no sample tubes.\nThe tubes in the tuberacks in slot 10, 11, 7 and 8 constitute the 1st tuberack quadrant, and should be regarded as a single unit (Tuberack quadrant 1) consisting of 4 rows of tubes with 12 columns. Samples are transferred in row order to quadrant 1 of the target plate for Sample set 1, and to quadrant 3 for Sample set 2.\nSimilarly the tuberacks in slot 4, 5, 1 and 2 constitute Tuberack quadrant 2. Samples from Sample set 1 in Tuberack quadrant 2 are transferred to Target quadrant 2, and samples from Sample set 2 are transferred to Target quadrant 4.\n96 well-plate layout\n```\nTarget quadrant 1 (top left)\nA1-D1 to A6-D6 (A1-A3 are unused)\nTarget quadrant 2 (top right)\nA7-D7 to A12-D12\nTarget quadrant 3 (bottom left)\nE1-H1 to E6-H6\nTarget quadrant 4 (bottom right)\nE7-H7 to E12-H12\n```\nExplanation of parameters below:\n Is there a first set of tubes?: Is there a first set of tubes? (Sometimes the user may have already transferred the first set of tubes and wants the protocol to run from the second set of tuberack samples)\n Number of tubes/samples in the first set of tubes: How many tubes there are in the first set of tube racks. These samples will be transferred to quadrant 1 (and 2) of the destination plate\n Is there a second set of tubes?: Whether to pause the protocol so that a second set of tube racks can be loaded onto the deck\n Number of tubes/samples in the second set of tubes: How many samples there are in the second set of tuberacks (Only needs to be set if a second set of tube racks is loaded)\n Sample volume (µL) to aspirate: Volume of sample to transfer (5 or 50 µL). This parameter controls which pipette and tiprack is used: 5 uL means that the 20 uL pipette will be used in in the right mount, and that the pipette tips should be filtered 20 uL tips. 50 uL means that the 300 uL pipette will be used in the left mount along with 200 uL filter tips.\n Aspiration flow rate (µL/s): rate of aspiration in microliters per second\n Dispension flow rate (µL/s): rate of dispension in microliters per second\n Aspiration height from the bottom of the tubes (mm): Height from the bottom of the tubes to aspirate from in mm\n Dispension height from the bottom of the tubes (mm): Height from the bottom of the plate wells to dispense from in mm\n (Optional) Temperature module with aluminum block: Parameter to indicate whether you are using a temperature module with an aluminum block to put your target plate on\n Set temperature of the temperature module: Temperature to set on the temperature module in degrees C\n Amount of time to keep the pipette in the tube after aspiration (s): How many seconds to wait before withdrawing the pipette from the tube after aspiration\n",
    "internal": "300073",
    "labware": "\n4-in-1 tube racks\nStellar Scientific 96 well plate\n",
    "markdown": {
        "author": "[Opentrons](https://opentrons.com/)\n\n",
        "categories": "* Sample Prep\n\t* PCR prep\n\n",
        "deck-setup": "![deck layout](https://opentrons-protocol-library-website.s3.amazonaws.com/custom-README-images/300073/deck.jpg)\n\n---\n\n",
        "description": "This protocol transfers saliva samples from 25 mL tubes to a 96 well plate. The samples are located in 6 4-in-4 tube racks on the left side of the deck. Optionally a second set of tube racks can replace the first one if more than 45 samples need to be distributed. Optionally the target plate can be placed on a temperature module with an aluminum block.\n\nThe destination plate is divided into four quadrants and the samples are distributed in a zig zag pattern from top left - top right - bottom left - bottom right (see below). Samples are not transferred to the three first wells of the target plate because they contain control samples, symmetrically the first 3 tube slots in Sample set 1:Tuberack quadrant 1 contain no sample tubes.\n\nThe tubes in the tuberacks in slot 10, 11, 7 and 8 constitute the 1st tuberack quadrant, and should be regarded as a single unit (Tuberack quadrant 1) consisting of 4 rows of tubes with 12 columns. Samples are transferred in row order to quadrant 1 of the target plate for Sample set 1, and to quadrant 3 for Sample set 2.\n\nSimilarly the tuberacks in slot 4, 5, 1 and 2 constitute Tuberack quadrant 2. Samples from Sample set 1 in Tuberack quadrant 2 are transferred to Target quadrant 2, and samples from Sample set 2 are transferred to Target quadrant 4.\n\n**96 well-plate layout**\n```\nTarget quadrant 1 (top left)\nA1-D1 to A6-D6 (A1-A3 are unused)\n\nTarget quadrant 2 (top right)\nA7-D7 to A12-D12\n\nTarget quadrant 3 (bottom left)\nE1-H1 to E6-H6\n\nTarget quadrant 4 (bottom right)\nE7-H7 to E12-H12\n```\n\nExplanation of parameters below:\n* `Is there a first set of tubes?`: Is there a first set of tubes? (Sometimes the user may have already transferred the first set of tubes and wants the protocol to run from the second set of tuberack samples)\n* `Number of tubes/samples in the first set of tubes`: How many tubes there are in the first set of tube racks. These samples will be transferred to quadrant 1 (and 2) of the destination plate\n* `Is there a second set of tubes?`: Whether to pause the protocol so that a second set of tube racks can be loaded onto the deck\n* `Number of tubes/samples in the second set of tubes`: How many samples there are in the second set of tuberacks (Only needs to be set if a second set of tube racks is loaded)\n* `Sample volume (µL) to aspirate`: Volume of sample to transfer (5 or 50 µL). This parameter controls which pipette and tiprack is used: 5 uL means that the 20 uL pipette will be used in in the right mount, and that the pipette tips should be filtered 20 uL tips. 50 uL means that the 300 uL pipette will be used in the left mount along with 200 uL filter tips.\n* `Aspiration flow rate (µL/s)`: rate of aspiration in microliters per second\n* `Dispension flow rate (µL/s)`: rate of dispension in microliters per second\n* `Aspiration height from the bottom of the tubes (mm)`: Height from the bottom of the tubes to aspirate from in mm\n* `Dispension height from the bottom of the tubes (mm)`: Height from the bottom of the plate wells to dispense from in mm\n* `(Optional) Temperature module with aluminum block`: Parameter to indicate whether you are using a temperature module with an aluminum block to put your target plate on\n* `Set temperature of the temperature module`: Temperature to set on the temperature module in degrees C\n* `Amount of time to keep the pipette in the tube after aspiration (s)`: How many seconds to wait before withdrawing the pipette from the tube after aspiration\n\n---\n\n",
        "internal": "300073\n",
        "labware": "* [4-in-1 tube racks](https://shop.opentrons.com/4-in-1-tube-rack-set/)\n* [Stellar Scientific 96 well plate](https://www.stellarscientific.com/96-well-low-profile-fast-type-pcr-plate-with-raised-rim-edge-0-1ml-rnase-and-dnase-free-clear-100-cs/)\n\n",
        "modules": "* [Temperature Module (GEN2)](https://shop.opentrons.com/collections/hardware-modules/products/tempdeck)\n\n",
        "notes": "If you have any questions about this protocol, please contact the Protocol Development Team by filling out the [Troubleshooting Survey](https://protocol-troubleshooting.paperform.co/).\n\n",
        "pipettes": "* [20 µL single-channel pipette gen2](https://shop.opentrons.com/single-channel-electronic-pipette-p20/) - Load in the right mount\n* [300 µL single-channel pipette gen2](https://shop.opentrons.com/single-channel-electronic-pipette-p20/) - Load in the left mount\n* [20 µL filter tips](https://shop.opentrons.com/opentrons-20ul-filter-tips/) - When the sample volume is 5 uL\n* [200 µL filter tips](https://shop.opentrons.com/opentrons-200ul-filter-tips/) - When the sample volume is 50 uL\n\nNote that there is only one tiprack that goes into slot 9 per run which is determined by the sample volume.\n\n---\n\n",
        "process": "1. Input your protocol parameters above.\n2. Download your protocol and unzip if needed.\n3. Upload your custom labware to the [OT App](https://opentrons.com/ot-app) by navigating to `More` > `Custom Labware` > `Add Labware`, and selecting your labware files (.json extensions) if needed.\n4. Upload your protocol file (.py extension) to the [OT App](https://opentrons.com/ot-app) in the `Protocol` tab.\n5. Set up your deck according to the deck map.\n6. Calibrate your labware, tiprack and pipette using the OT App. For calibration tips, check out our [support articles](https://support.opentrons.com/en/collections/1559720-guide-for-getting-started-with-the-ot-2).\n7. Hit 'Run'.\n\n",
        "protocol-steps": "1. If a temperature module is on the deck the first step is to set the temperature according to the parameter.\n2. Samples are transferred from the first set of tubes to the destination plate\n3. If a second set of tuberacks are designated the protocol pauses and allows the user to switch out the tube racks before continuing.\n4. The second set of samples is transferred from the tubes to the destination plate\n\n",
        "title": "Saliva sample transfer from tuberacks to 96 well plate"
    },
    "modules": [
        "Temperature Module (GEN2)"
    ],
    "notes": "If you have any questions about this protocol, please contact the Protocol Development Team by filling out the Troubleshooting Survey.",
    "pipettes": "\n20 µL single-channel pipette gen2 - Load in the right mount\n300 µL single-channel pipette gen2 - Load in the left mount\n20 µL filter tips - When the sample volume is 5 uL\n200 µL filter tips - When the sample volume is 50 uL\n\nNote that there is only one tiprack that goes into slot 9 per run which is determined by the sample volume.\n",
    "process": "\nInput your protocol parameters above.\nDownload your protocol and unzip if needed.\nUpload your custom labware to the OT App by navigating to More > Custom Labware > Add Labware, and selecting your labware files (.json extensions) if needed.\nUpload your protocol file (.py extension) to the OT App in the Protocol tab.\nSet up your deck according to the deck map.\nCalibrate your labware, tiprack and pipette using the OT App. For calibration tips, check out our support articles.\nHit 'Run'.\n",
    "protocol-steps": "\nIf a temperature module is on the deck the first step is to set the temperature according to the parameter.\nSamples are transferred from the first set of tubes to the destination plate\nIf a second set of tuberacks are designated the protocol pauses and allows the user to switch out the tube racks before continuing.\nThe second set of samples is transferred from the tubes to the destination plate\n",
    "title": "Saliva sample transfer from tuberacks to 96 well plate"
}